---
kind: method
id: M:Autodesk.Revit.DB.DocumentSet.ForwardIterator
source: html/209f9cb1-7a9b-7369-76de-670c0eb16e80.htm
---
# Autodesk.Revit.DB.DocumentSet.ForwardIterator Method

Retrieve a forward moving iterator to the set.

## Syntax (C#)
```csharp
public virtual DocumentSetIterator ForwardIterator()
```

## Returns
Returns a forward moving iterator to the set.